Tekla Open API Reference for Tekla Structures 2025
Events.InitializeLifetimeService Method
 Initializes the lifetime service.
 Namespace: Tekla.Structures.Drawing.UI
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override Object InitializeLifetimeService()
Public Overrides Function InitializeLifetimeService As Object
Return Value
Type: Object
Always null.
See Also
Reference
Events Class
Tekla.Structures.Drawing.UI Namespace